
########################### Define Top Module ############################
                                                   
set top_module SYS_TOP

######################### Formality Setup File ###########################

set synopsys_auto_setup true

set_svf "/home/IC/SYSTEM/post_dft_formal/dft/$top_module.svf"


set SSLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"

######################### Reference Container ############################

## Read Reference technology libraries

read_db -container Ref "/home/IC/SYSTEM/post_dft_formal/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
## Read Reference Design Files
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/ALU.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/BUSY_PULSE_GENERATOR.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/CLK_GATE.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/CLOCK_DIV.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/mux2X1.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/DATA_SAMPLING.v"
read_verilog -container Ref  "/home/IC/SYSTEM/rtl/DATA_SYNC.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/DE_SERIALIZER.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/D_SYNC_RD.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/D_SYNC_WR.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/EDGE_BIT_COUNTER.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/enable_sync.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FIFO_MEM.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FIFO_RD.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FIFO_TOP.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FIFO_WR.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FSM.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/FSM_TX.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/input_division_rx_ratio.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/MUX.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/PARITY_CALC.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/PARITY_CHECK.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/pulse_generator.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/Register_file.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/RST_SYNC.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/SERIALIZER.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/STOP_CHECK.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/STR_CHECK.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/sync_bus.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/SYS_CTRL.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/UART_RX_TOP.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/UART_SYS_TOP.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/UART_TX_TOP.v"
read_verilog -container Ref "/home/IC/SYSTEM/rtl/SYS_TOP.v"

## set the top Reference Design 
set_reference_design SYS_TOP
set_top SYS_TOP

######################## Implementation Container #########################

## Read Implementation technology libraries

read_db -container Imp "/home/IC/SYSTEM/post_dft_formal/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
## Read Implementation Design Files

 read_verilog -container Imp "/home/IC/SYSTEM/post_dft_formal/dft/netlists/SYS_TOP.v"
## set the top Implementation Design
set_implementation_design SYS_TOP
set_top SYS_TOP

############################### Don't verify #################################

# do not verify scan in & scan out ports as a compare point as it is existed only after synthesis and not existed in the RTL

#scan in
set_dont_verify_points -type port Ref:/WORK/*/SI
set_dont_verify_points -type port Imp:/WORK/*/SI

#scan_out
set_dont_verify_points -type port Ref:/WORK/*/SO
set_dont_verify_points -type port Imp:/WORK/*/SO

############################### constants #####################################

# all atpg enable(test_mode, scan_enable) are zero during formal compare

#test_mode
set_constant Ref:/WORK/*/test_mode 0
set_constant Imp:/WORK/*/test_mode 0

#scan_enable
set_constant Ref:/WORK/*/SE 0
set_constant Imp:/WORK/*/SE 0


########################### matching Compare points ##########################

match

################################# verify #####################################

set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

report_passing_points > "reports/passing_points.rpt"
report_failing_points > "reports/failing_points.rpt"
report_aborted_points > "reports/aborted_points.rpt"
report_unverified_points > "reports/unverified_points.rpt"


start_gui
